app/Controllers/AuthController.php

    public function procesarLogin()
    {
        $nombre = $this->request->getPost('nombre');
        $password = $this->request->getPost('password');

        $usuarioModel = new UsuarioModel();
        $usuario = $usuarioModel->where('nombre', $nombre)->first();
---
SELECT *
FROM `usuarios`
WHERE `nombre` = 'jefedeposito'
 LIMIT 1