app/Controllers/Home.php

    public function index()
    {
        $productoModel = new ProductoModel();

        $hoy = date('Y-m-d');
        $destacados = $productoModel
            ->where('oferta', 'SI')
            ->where('baja', 'NO')
            ->groupStart()
                ->where('oferta_fin IS NULL')
                ->orWhere('oferta_fin >=', '2025-07-06')
            ->groupEnd()
            ->findAll();
---
SELECT *
FROM `productos`
WHERE `oferta` = 'SI'
AND `baja` = 'NO'
AND   (
`oferta_fin` IS NULL
OR `oferta_fin` >= '2025-07-06'
 )