app/Controllers/JefeDepositoController.php

        }

        // 📊 Totales
        $productos_cargados = $db->table('productos_deposito')->countAll();
        $vencimientos_registrados = $db->table('vencimientos')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `productos_deposito`
SELECT COUNT(*) AS `numrows` FROM `vencimientos`