app/Controllers/VencimientosController.php

SELECT `v`.`fecha_vencimiento`, `v`.`created_at`, `p`.`codigo_riera`, `p`.`nombre` AS `producto`, `p`.`proveedor`, `p`.`lote`, `p`.`pasillo`
FROM `vencimientos` `v`
JOIN `productos_deposito` `p` ON `p`.`id` = `v`.`producto_id`
WHERE `v`.`fecha_vencimiento` <= '2052-11-29'
ORDER BY `v`.`fecha_vencimiento` ASC
---
    public function vencimientosPorDias($dias = 9999)
    {
        $filtroDias = $this->request->getGet('filtro_dias');
        if ($filtroDias !== null) {
            $dias = (int)$filtroDias;
        }

        $fechaLimite = date('Y-m-d', strtotime("+$dias days"));

        $db = \Config\Database::connect();
        $builder = $db->table('vencimientos v');
        $builder->select('v.fecha_vencimiento, v.created_at, p.codigo_riera, p.nombre AS producto, p.proveedor, p.lote, p.pasillo');
        $builder->join('productos_deposito p', 'p.id = v.producto_id');
        $builder->where('v.fecha_vencimiento <=', $fechaLimite);
        $builder->orderBy('v.fecha_vencimiento', 'ASC');

        $vencimientos = $builder->get()->getResultArray();