app/Controllers/VencimientosController.php

public function vencimientosPorDias($dias)
{
    $fechaLimite = date('Y-m-d', strtotime("+$dias days"));

    $db = \Config\Database::connect();
    $builder = $db->table('vencimientos v');
    $builder->select('v.fecha_vencimiento, v.created_at, p.pasillo, u.nombre AS pasillero, p.nombre AS producto');
    $builder->join('usuarios u', 'u.id = v.usuario_id');
    $builder->join('productos_deposito p', 'p.id = v.producto_id');
    $builder->where('v.fecha_vencimiento <=', $fechaLimite);
    $builder->orderBy('v.fecha_vencimiento', 'ASC');

    $vencimientos = $builder->get()->getResultArray();
---
SELECT `v`.`fecha_vencimiento`, `v`.`created_at`, `p`.`pasillo`, `u`.`nombre` AS `pasillero`, `p`.`nombre` AS `producto`
FROM `vencimientos` `v`
JOIN `usuarios` `u` ON `u`.`id` = `v`.`usuario_id`
JOIN `productos_deposito` `p` ON `p`.`id` = `v`.`producto_id`
WHERE `v`.`fecha_vencimiento` <= '2025-08-10'
ORDER BY `v`.`fecha_vencimiento` ASC

    public function exportarPdf()
    {
        $dias = $this->request->getGet('filtro_dias');
        $fechaActual = date('d/m/Y');

        $db = \Config\Database::connect();
        $builder = $db->table('vencimientos v');
        $builder->select('v.fecha_vencimiento, v.created_at, p.pasillo, u.nombre AS pasillero, p.nombre AS producto');
        $builder->join('usuarios u', 'u.id = v.usuario_id');
        $builder->join('productos_deposito p', 'p.id = v.producto_id');
        $builder->where('v.fecha_vencimiento <=', date('Y-m-d', strtotime("+$dias days")));
        $builder->orderBy('v.fecha_vencimiento', 'ASC');

        $vencimientos = $builder->get()->getResultArray();
---
SELECT `v`.`fecha_vencimiento`, `v`.`created_at`, `p`.`pasillo`, `u`.`nombre` AS `pasillero`, `p`.`nombre` AS `producto`
FROM `vencimientos` `v`
JOIN `usuarios` `u` ON `u`.`id` = `v`.`usuario_id`
JOIN `productos_deposito` `p` ON `p`.`id` = `v`.`producto_id`
WHERE `v`.`fecha_vencimiento` <= '2025-08-25'
ORDER BY `v`.`fecha_vencimiento` ASC