app/Models/VencimientoModel.php

    public function obtenerParaJefe($filtro_dias = null)
{
    $builder = $this->db->table('productos_deposito');
    $builder->select('*');

    if ($filtro_dias && is_numeric($filtro_dias)) {
        $fecha_limite = date('Y-m-d', strtotime("+$filtro_dias days"));
        $builder->where('fecha_vencimiento <=', $fecha_limite);
    }

    return $builder->get()->getResultArray();
---
SELECT *
FROM `productos_deposito`
WHERE `fecha_vencimiento` <= '2025-09-11'